labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  if (!iac_part)
    return hc05.readOperationResult() && false;

  iac = htoul(iac_part);

  return hc05.readOperationResult();

  
  

}

/****************************************************************
*FUNCTION NAME:process
*FUNCTION     :process
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processInquiryMode(HC05_InquiryMode &inq_mode,
  int16_t &max_devices, uint8_t &max_duration, uint16_t addrs)
{

  inq_mode = HC05_INQUIRY_STANDARD;
  max_devices = 0;
  max_duration = 0;

  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+INQM:");
  char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_INQM);
  debugTerminal("HC05_InquiryMode");
  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  inq_mode = static_cast<HC05_InquiryMode>(atol(mode_part));
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_devices = atol(++mode_part);
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_duration = atol(++mode_part);

  return hc05.readOperationResult();
  
  

}

/****************************************************************
*FUNCTION NAME:processPassword
*FUNCTION     :processPassword
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processPassword(char *buffer, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  
  debugTerminal("HC05_Password");

  
  char response[HC05_PASSWORD_MAXLEN + 15];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+PSWD:");
  const char *password_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_PSWD);

  if (m_errCode != HC05_OK)
  {
    *buffer = 0;
    return false;
  }

  if (!password_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, HC05_PASSWORD_BUFSIZE, "%s", password_part);

  return hc05.readOperationResult();


  // update Flash IC here
		
  
  

}

/****************************************************************
*FUNCTION NAME:processSerialMode
*FUNCTION     :processSerialMode
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processSerialMode(uint32_t &speed, uint8_t &stop_bits,
  HC05_Parity &parity, uint16_t addrs)
{
	
  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+UART:");
  char *mode_str = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_UART);
  		
   debugTerminal("HC05_SerialMode");

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_str)
    return hc05.readOperationResult() && false;

  speed = atol(mode_str);
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  stop_bits = atol(++mode_str) + 1;
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  parity = static_cast<HC05_Parity>(atol(++mode_str));

  return hc05.readOperationResult();

  // update Flash IC here

  
  

}

/****************************************************************
*FUNCTION NAME:processConnectionMode
*FUNCTION     :processConnectionMode
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processConnectionMode(
  HC05_Connection &connection_mode, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("HC05_ConnectionMode");
  

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CMOD:");
  const char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CMODE);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  connection_mode = static_cast<HC05_Connection>(atol(mode_part));

  return hc05.readOperationResult();

  
  
  

}

/****************************************************************
*FUNCTION NAME:processLed
*FUNCTION     :processLed
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processLed(bool &led_status,
  bool &led_connection, uint16_t addrs)
{


  // update Flash IC here
		
   debugTerminal("HC05_getLedStatus");
  
  led_status = 0;
  led_connection = 0;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+POLAR:");
  
  char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_POLAR);

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;

  led_status = atol(status_part);
  status_part = strchrnul(status_part, ',');

  if (*status_part != ',')
    return hc05.readOperationResult() && false;

  led_connection = atol(++status_part);

  return hc05.readOperationResult();

  

}

/****************************************************************
*FUNCTION NAME:processPortState
*FUNCTION     :processPortState
*INPUT        :addrs
*OUTPUT       :void
****************************************************************/
bool LIB_HC05::processPortState(uint8_t port_num,
  uint8_t port_state, uint16_t addrs)
{
	char      *strStart, *str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  
  
  if(str1!=NULL)
    sscanf(str1,"%s",Sim80x.IMEI);

  // update Flash IC here
		
